<!DOCTYPE html>
<html>
    <head>
        <meta charset="utf-8">
<title>
    Атрибут lang
</title>
<style>
    p {font-size: 160%;
    }
    q:lang(en) {
    quotes: "\201C" "\201D";
    }
    q:lang(fr),q:lang(ru) {
    quotes: "\00AB" "\00BB";
    }
</style>
    </head>
    <body>
        <p>
         <p><b>ВИРАХОВУВАННЯ ПОТУЖНОСТІ ЕЛЕКТРОДВИГУНІВ ТА РОЗРАХУНОК ЕЛЕКТРООБЛАДНАННЯ СВЕРДЛИЛЬНОГО ВЕРСТАТА</p></b>
</q>
        </p>

 <style>
   h1 {
    font-family: 'Times New Roman', Times, serif; /* Гарнитура текста */ 
    font-size: 200%; /* Размер шрифта в процентах */ 
   } 
   p {
    font-family: Verdana, Arial, Helvetica, sans-serif; 
    font-size: 10pt; /* Размер шрифта в пунктах */ 
   }
  </style>

 <h5 align="right">Проект виконано у рамках дисципліни "Електроустаткування підприємств і цивільних споруд" здобувачами освіти Старокожком В'яеславом та Сергеєвим Юрієм. </h5>
 <h5 align="right">Керівник проекту Лактіонов Олександр</h5>
 <h5 align="right">Консультацію надає консультант дослідженя Старокожко В'яеслав, тел. (098)-428-62-15 </h5>

    <form method="GET">
     <fieldset><!-- Створюємо загальний блок форми для вираховування дев'яти кроків формул потужності електродвигуна головного приводу свердлильного верстата' -->

<p><b>І. ВИРАХОВУВАННЯ ПОТУЖНОСТІ ГОЛОВНОГО ЕЛЕКТРОПРИВОДА СВЕРДЛИЛЬНОГО ВЕРСТАТА</p></b>


<fieldset>
<legend>КРОК 0. Визначення подачі свердління у залежності від діаметра ріжучого інструменту</legend>
<p> Подача при свердлінні сталі у залжності від діаметра ріжучого інструменту D, мм:</p><select  type="text" name="D" value=""size="1px">
<optgroup label="Діаметр ріжучого інструменту D, мм">
        <option  value="0.75">Діаметр ріжучого інструменту D, 6...10 мм, подача при свердлінні сталі 0.18...0.28 мм/об</option>
  <option  value="0.75">Діаметр ріжучого інструменту D, 10...25 мм, подача при свердлінні сталі 0.25...0.35 мм/об</option>
<option  value="0.75">Діаметр ріжучого інструменту D, 15...20 мм, подача при свердлінні сталі 0.34...0.43 мм/об</option>
<option  value="0.75">Діаметр ріжучого інструменту D, 20...25 мм, подача при свердлінні сталі 0.39...0.47 мм/об</option>
<option  value="0.75">Діаметр ріжучого інструменту D, 25...30 мм, подача при свердлінні сталі 0.45...0.55 мм/об</option>
<option  value="0.75">Діаметр ріжучого інструменту D, 30...40 мм, подача при свердлінні сталі 0.55...0.6 мм/об</option>
<option  value="0.75">Діаметр ріжучого інструменту D, 40...50 мм, подача при свердлінні сталі 0.6...0.65 мм/об</option>
<option  value="0.75">Діаметр ріжучого інструменту D, 50...60 мм, подача при свердлінні сталі 0.65...0.7 мм/об</option>
   </optgroup>
        </select></p>

       
</fieldset>







<fieldset>
<legend>КРОК 1. Вираховування поправочного коефіцієнта на осьову складову сили різання, Kp</legend>
        <p>Межа міцності матеріалу заготовки, сігма, МПа: <input  type="text" name="sigb" value="" size="2px"></p>
        <p>Показник степені у формулі осьової складової сили різання: <select type="text" name="np" value="" size="1px"></p>
        <optgroup label="Показник степені np при оброблювальному матеріалі сталь конструкційна і стальне лиття з 
        межою міцності менше 600 Мпа">
        <option  value="0.75">Матеріал ріжучої частини інструмента - твердий сплав, np=0.75</option>
        <optgroup label="Показник степені np при оброблювальному матеріалі сталь конструкційна і стальне лиття з 
        межою міцності менше 600 Мпа">
        <option name="np" value="0.35">Матеріал ріжучої частини інструмента - швидкоріжуча сталь, np=0.35</option>
        <optgroup label="Показник степені np при оброблювальному матеріалі сталь конструкційна і стальне лиття з 
        межою міцності менше 600 Мпа">
        <option  name="np" value="1.35">Матеріал ріжучої частини інструмента - твердий сплав, np=1.35</option>
        </optgroup>
        </select></p>
        <input type="submit" name="" value="Вирахувати поправочний коефіцієнт на осьову складову сили різання, Kp">
        
        <input type="text" name="" value="
        <?php

        $sigb = $_GET['sigb'];
        $np = $_GET['np'];
        $Kp=pow ($sigb/75, $np);
        echo $Kp;

        

          ?>
        ">
        </fieldset>
        </form>





      






        <form method="GET">
<!-- Створюємо блок групування елементів у формі для вираховування осьової складової сили різання-->
      <fieldset>
    <legend>КРОК 2.Вираховування осьової складової сили різання, Р0, Н</legend>
        <p>Коефіцієнт формули осьової складової сили різання, що залежить від властивостей матеріалу, який обробляється, Cp:</p><select  type="text" name="Cp" value="" size="1px">
        <optgroup label="Обробка матеріалу сталь конструкційна і стальне лиття з межою міцності 750 Мпа шляхлом свердління">
        <option value="68">Матеріал ріжучої частини інструмента - швидкоріжуча сталь, Ср=68</option>
        <optgroup label="Обробка матеріалу сталь конструкційна і стальне лиття з межою міцності 750 Мпа шляхлом розсвердлювання">
        <option value="37.8">Матеріал ріжучої частини інструмента - швидкоріжуча сталь, Ср=37.8</option>
        <optgroup label="Обробка матеріалу сталь жаростійка Х18Н9Т шляхлом свердління ">
        <option value="143">Матеріал ріжучої  частини інструмента - швидкоріжуча сталь, Ср=143</option>
        </optgroup>
        </select></p>
 
        <p>Показник степені формули осьової складової сили різання, що залежить від властивостей матеріалу, який обробляється, qp:</p><select  type="text"  name="qp" value="" size="1px">
        <optgroup label="Обробка матеріалу сталь конструкційна і стальне лиття з межою міцності 750 Мпа шляхлом свердління">
        <option value="1">Матеріал ріжучої  частини інструмента - швидкоріжуча сталь, qp=1.0</option>
        <optgroup label="Обробка матеріалу сталь конструкційна і стальне лиття з межою міцності 750 Мпа шляхлом розсвердлювання">
        <option value="1">Матеріал ріжучої  частини інструмента - швидкоріжуча сталь, qp=1.0</option>
        <optgroup label="Обробка матеріалу сталь жаростійка Х18Н9Т шляхлом свердління">
        <option value="1">Матеріал ріжучої  частини інструмента - швидкоріжуча сталь, qp=1.0</option>
        </optgroup>
        </select></p>

        <p>Показник степені формули осьової складової сили різання, що залежить від властивостей матеріалу, який обробляється, yp:</p><select  type="text" name="yp" value=""size="1px">
        <optgroup label="Обробка матеріалу сталь конструкційна і стальне лиття з межою міцності 750 Мпа шляхлом свердління">
        <option value="0.7">Матеріал ріжучої  частини інструмента - швидкоріжуча сталь, yp=0.7</option>
        <optgroup label="Обробка матеріалу сталь конструкційна і стальне лиття з межою міцності 750 Мпа шляхлом розсвердлювання">
        <option value="0.7">Матеріал ріжучої  частини інструмента - швидкоріжуча сталь, yp=0.7</option>
        <optgroup label="Обробка матеріалу сталь жаростійка Х18Н9Т шляхлом свердління">
        <option value="0.7">Матеріал ріжучої  частини інструмента - швидкоріжуча сталь, yp=0.7</option>
        </optgroup>
        </select></p>

        <p>Діаметр ріжучого інструменту D, мм:</p><input  type="text" name="D" value=""size="1px">
        <p>Подача S0, мм/об:</p><input  type="text" name="S0" value="" size="1px">     
        <p>Поправочний коефіцієнт на осьову складову сили різання, Kp:</p><input  type="text" name="Kp" value="" size="1px">   
        </input></p>
        <input type="submit" name="" value="Вирахувати осьову складову сили різання, Р0, Н">
        <input type="text" name="" value="
 <?php
          $Cp = $_GET['Cp'];
          $D = $_GET['D'];
          $qp = $_GET['qp'];
          $S0 = $_GET['S0'];
          $yp = $_GET['yp'];
          $Kp = $_GET['Kp'];
          $P0=9.81*$Cp*(pow($D, $qp))*(pow($S0, $yp))*$Kp;
          echo $P0;
          ?>
          ">
<p>У випадку перевантаження механізму подачі верстата, P0>Рmax, потрібно зменшити подачу S0 настільки, щоб виконалася умова P0=Рmax, та розрахувати п.2.1. 
     </fieldset>
  </form>


<fieldset>
<legend>КРОК 2.1. Здійснюємо вираховування подачі при перевантаженні механізму подачі верстата</legend>

 <body>
  <p><img src="images/Крок 2.1.JPEG" alt="Крок 2.1"></p>
 </body>

</fieldset>

     <form method="GET">
<!-- Створюємо блок групування елементів у формі для вираховування поправочних коефіцієнтів у формулі швидкості різання-->
   <fieldset>
 <legend>КРОК 3. Вираховування поправочного коефіцієнта, Kv, який враховує вплив механічних властивостей оброблювального матеріалу на швидкість різання, де оброблювальний матеріал сталь конструкційна вуглеродиста, легована і стальне лиття при матеріалі ріжучої частини інструмента - швидкоріжуча сталь </legend>
      
       <fieldset>
        <legend> КРОК 3.1. Вираховування "першого" поправочного коефіцієнта Kmv </legend>
        <p>Коефіцієнт См, що враховує групу сталі: <select  type="text" name="Cm" value="" size="1px"></p>
        <optgroup label="Оброблювальний матеріал - cталь вуглеродиста, cталь нікелева, cталь хромиста">
        <option value="1.0">См=1.0</option>
        <optgroup label="Оброблювальний матеріал - cталь автоматна">
        <option value="1.2">См=1.2</option>
        <optgroup label="Оброблювальний матеріал - cталь хромонікелева">
        <option value="0.9">См=0.9</option>
        </optgroup>
        </select></p>
 
        <p>Показник степені у формулі вираховування поправочного коефіцієнта при операції свердління і розсвердлювання, nv: <select type="text" name="nv" value=""size="1px"></p>
        <optgroup label="Оброблювальний матеріал - cталь вуглеродиста, cталь автоматна, cталь нікелева, cталь хромиста, cталь хромонікелева">
        <option value="0.9">nv=0.9</option>
        </optgroup>
        </select></p>

        <p>Межа міцності матеріалу заготовки, сігма, МПа: <input type="text" name="sigb" value="" size="2px"></p>
        </p>
        <input type="submit" name="" value="Вирахувати поправочний коефіцієнт, Kmv, на швидкість головного руху різання">
        <input type="text" name="" value="
        <?php
          $sigb = $_GET['sigb'];
          $nv = $_GET['nv'];
          $Cm = $_GET['Cm'];                  
          $Kmv=  $Cm*( pow(75/$sigb, $nv));
                    echo $Kmv;
          
         ?>
         ">
</fieldset>
  </form>






<form method="GET">
<fieldset>
<legend> Крок 3.2. Вираховування поправочних коефіцієнтів Kuv,Klv, які враховують відповідно марку інструментального матеріалу та вплив глибини оброблювального отвору </legend>
      <p>Поправочний коефіцієнт Kuv, що враховує марку інструментального матеріалу: <select type="text" name="Kuv" value="" size="1px"></p>
      <optgroup label="Оброблювальний матеріал">
      <option value="0.35">Cталь і конструкційне лиття Т5К12В, Kuv=0.35</option>
      <optgroup label="Оброблювальний матеріал">
      <option value="0.65">Cталь і конструкційне лиття Т5К10, Kuv=0.65</option>
      <optgroup label="Оброблювальний матеріал">
      <option value="0.8">Cталь і конструкційне лиття Т14К8, Kuv=0.8</option>
      <optgroup label="Оброблювальний матеріал">
      <option value="1.0">Cталь і конструкційне лиття Т15К6, Kuv=1.0</option>
      <optgroup label="Оброблювальний матеріал">
      <option value="1.15">Cталь і конструкційне лиття Т15К6, Kuv=1.15</option>
      <optgroup label="Оброблювальний матеріал">
      <option value="1.4">Cталь і конструкційне лиття Т30К4, Kuv=1.4</option>
      <optgroup label="Оброблювальний матеріал - ">
      <option value="0.4">Cталь і конструкційне лиття ВК8, Kuv=0.4</option>
      </optgroup>
      </select></p>

      <p>Поправочний коефіцієнт Klv, на швидкість різання, що враховує вплив глибини оброблювального отвору: <select  type="text" name="Klv" value="" size="1px"></p>
      <optgroup label="Глибина оброблювального отвору у діаметрах - 3D">
      <option value="1.0">Klv=1.0</option>
      <optgroup label="Глибина оброблювального отвору у діаметрах - 4D">
      <option value="0.85">Klv=0.85</option>
      <optgroup label="Глибина оброблювального отвору у діаметрах - 5D">
      <option value="0.75">Klv=0.75</option>
      <optgroup label="Глибина оброблювального отвору у діаметрах - 6D">
      <option value="0.7">Klv=0.7</option>
      <optgroup label="Глибина оброблювального отвору у діаметрах - 8D">
      <option value="0.6">Klv=0.6</option>
      <optgroup label="Глибина оброблювального отвору у діаметрах - більше 8D">
      <option value="1.0">Klv=1.0</option>
      </optgroup>
      </select></p>

      <p>Поправочний коефіцієнт Kmv, на швидкість головного руху різання: <input  type="text" name="Kmv" value="" size="1px"></p>
      </input></p>
      <input type="submit"  name="" value="Вирахувати поправочний коефіцієнт, Kv, на швидкість головного руху різання">
      <input type="text" name="" value="
<?php
         
          $Klv = $_GET['Klv'];
          $Kuv = $_GET['Kuv'];
          $Kmv = $_GET['Kmv'];             
          $Kv=$Klv*$Kuv*  $Kmv;
          echo $Kv;
          
         ?>
">
 </fieldset>
  </form>

<form method="GET">
</fieldset>
<!-- Створюємо блок групування елементів у формі для вираховування швидкості різання-->
 <fieldset>
 <legend>КРОК 4. Вираховування швидкості головного руху різання, що допускається ріжучими властивостями свердла v, мм/хв </legend>
                        
   <p>Коефіцієнт у формулі швидкості різання, яка допускається ріжучими властивостями свердла, Cv:
   </p>
      <select  type="text" name="Cv" value="" size="1px">
   <optgroup label="Обробка матеріалу сталь конструкційна з межою міцності 750 Мпа шляхлом свердління, де матеріал ріжучого інструмента - Р18 при умовах обробки менше 0,2 мм/об">
   <option value="7.0">7.0</option>
   <optgroup label="Обробка матеріалу сталь конструкційна з межою міцності 750 Мпа шляхлом свердління, де матеріал ріжучого інструмента - Р18 при умовах обробки більше 0,2 мм/об">
   <option value="9.8">9.8</option>
   </optgroup>
   </select></p>

   <p>Показник степені у формулі швидкості різання, яка допускається ріжучими властивостями свердла, qv:</p><select  type="text" name="qv" value="" size="1px">
   <optgroup label="Обробка матеріалу сталь конструкційна з межою міцності 750 Мпа шляхлом свердління, де матеріал ріжучого інструмента - Р18 при умовах обробки менше 0,2 мм/об">
   <option value="0.4">0.4</option>
   <optgroup label="Обробка матеріалу сталь конструкційна з межою міцності 750 Мпа шляхлом свердління, де матеріал ріжучого інструмента - Р18 при умовах обробкибільше 0,2 мм/об">
   <option value="0.4">0.4</option>
   </optgroup>
   </select></p>

   <p>Показник степені у формулі швидкості різання, яка допускається ріжучими властивостями свердла, mv:</p><select  type="text" name="mv" value=""size="1px">
   <optgroup label="Обробка матеріалу сталь конструкційна з межою міцності 750 Мпа шляхлом свердління, де матеріал ріжучого інструмента - Р18 при умовах обробки менше 0,2 мм/об">
   <option value="0.2">0.2</option>
   <optgroup label="Обробка матеріалу сталь конструкційна з межою міцності 750 Мпа шляхлом свердління, де матеріал ріжучого інструмента - Р18 при умовах обробкибільше 0,2 мм/об">
   <option value="0.2">0.2</option>
   </optgroup>
   </select></p>

   <p>Показник степені у формулі швидкості різання, яка допускається ріжучими властивостями свердла, yv:</p><select  type="text" name="yv" value="" size="1px">
   <optgroup label="Обробка матеріалу сталь конструкційна з межою міцності 750 Мпа шляхлом свердління, де матеріал ріжучого інструмента - Р18 при умовах обробки менше 0,2 мм/об">
   <option value="0.7">0.7</option>
   <optgroup label="Обробка матеріалу сталь конструкційна з межою міцності 750 Мпа шляхлом свердління, де матеріал ріжучого інструмента - Р18 при умовах обробкибільше 0,2 мм/об">
   <option value="0.5">0.5</option>
   </optgroup>
   </select></p>

   <p>Діаметр ріжучого інструменту D, мм:</p><input  type="text" name="D" value="" size="1px">
   <p>Подача S0, мм/об:</p>
   <input  type="text" name="SO" value="" size="1px">     
   <p>Стійкість ріжучого інструменту T, хв при обробці сталі конструкційної і стального лиття матеріалом ріжучої частини інструменту - швидкоріжуча сталь шляхом свердління і розсвердлювання:</p><select  type="text" name="T" value="" size="1px"> 
   <optgroup label="Стійкість ріжучого інструменту при обробці сталі конструкційної і стального лиття матеріалом ріжучої частини інструменту - швидкоріжуча сталь шляхом свердління і розсвердлювання інструментом діаметорм до 5 мм">
   <option value="15">15</option>
   <optgroup label="Стійкість ріжучого інструменту діаметорм від 6 до 10 мм">
   <option value="25">25</option>
   <optgroup label="Стійкість ріжучого інструменту діаметорм від 11 до 20 мм">
   <option value="45">45</option>
   <optgroup label="Стійкість ріжучого інструменту діаметорм від 21 до 30 мм">
   <option value="50">50</option>
   <optgroup label="Стійкість ріжучого інструменту діаметорм від 31 до 40 мм">
   <option value="70">70</option>
   <optgroup label="Стійкість ріжучого інструменту діаметорм від 41 до 50 мм">
   <option value="90">90</option>
   <optgroup label="Стійкість ріжучого інструменту діаметорм від 51 до 60 мм">
  <option value="110">110</option>
  </optgroup>
  </select></p>

  <p>Поправочний коефіцієнт, Kv, який враховує вплив механічних властивостей оброблювального матеріалу на швидкість різання:</p><input  type="text" name="Kv" value="" size="1px">  
  </p>
  <input type="submit" name="v" value="Вирахувати швидкість головного руху різання, що допускається ріжучими властивостями свердла v, мм/хв">
  <input type="text" name="" value="
 <?php
 $Cv = $_GET['Cv'];
 $D = $_GET['D'];
 $qv = $_GET['qv'];
 $SO = $_GET['SO'];
 $yv = $_GET['yv'];
 $Kv = $_GET['Kv'];
 $T = $_GET['T'];
 $mv = $_GET['mv'];

 $vp=($Cv * (pow($D, $qv))) / ((pow($T, $mv)) * (pow($SO, $yv))) * $Kv;
 echo $vp;
 ?>
 ">
 </form>
 </fieldset>






<form method="GET">
<!-- Створюємо блок групування елементів у формі для вираховування частоти обертання шпинделя-->
<fieldset>
<legend>КРОК 5. Вираховування частоти обертання шпинделя, що відповідає знайденій швидкості головного руху різання n, хв</legend>
<p>Діаметр ріжучого інструменту D, мм:</p><input  type="text" name="D" value="" size="1px">
<p> Швидкість головного руху різання, що допускається ріжучими властивостями свердла v, м/хв:</p><input  type="text" name="v" value="" size="1px">
</input></p>
<input type="submit" name="" value="Вирахувати частоту обертання шпинделя, що відповідає знайденій швидкості головного руху різання n, хв">
<input type="text" name="" value="
<?php
$D = $_GET['D'];
$v = $_GET['v'];
$n=1000*$v/(3.14*$D);        
echo $n;
?>
">
</form>
</fieldset>






<form method="GET">
<!-- Створюємо блок групування елементів у формі для вираховування дійсної швидкості різання-->
 <fieldset>
<legend> КРОК 6. Вираховування дійсної швидкості головного руху різання vд, м/хв</legend>
<p>Діаметр ріжучого інструменту D, мм:</p><input  type="text" name="D" value="" size="1px">
<p>Дійсна швидкість головного руху різання nд, м/хв:</p><select  type="text" name="nd" value="" size="1px">
</p>

 <optgroup label="Верстат моделі 2Н125">
    <option value="49">Перший номер ступені, дійсна швидкість головного руху різання, nд=49</option>
    <option value="63">Дугий номер ступені, дійсна швидкість головного руху різання, nд=63</option>
    <option value="90">Третій номер ступені, дійсна швидкість головного руху різання, nд=90</option>
    <option value="125">Четвертий номер ступені, дійсна швидкість головного руху різання, nд=125</option>
    <option value="180">П'ятий номер ступені, дійсна швидкість головного руху різання, nд=180</option>
    <option value="250">Шостий номер ступені, дійсна швидкість головного руху різання, nд=250</option>
    <option value="355">Сьомий номер ступені, дійсна швидкість головного руху різання, nд=355</option>
    <option value="500">Восьмий номер ступені, дійсна швидкість головного руху різання, nд=500</option>
    <option value="710">Дев'ятий номер ступені, дійсна швидкість головного руху різання, nд=710</option>
    <option value="1000">Десятий номер ступені, дійсна швидкість головного руху різання, nд=1000</option>
    <option value="1400">Одинадцятий номер ступені, дійсна швидкість головного руху різання, nд=1400</option>
    <option value="2000">Дванадцятий номер ступені, дійсна швидкість головного руху різання, nд=2000</option>
    </optgroup>
    <optgroup label="Верстат моделі 2Н135">
    <option value="31.9">Перший номер ступені, дійсна швидкість головного руху різання, nд=31.9</option>
    <option value="45">Дугий номер ступені, дійсна швидкість головного руху різання, nд=45</option>
    <option value="63">Третій номер ступені, дійсна швидкість головного руху різання, nд=63</option>
    <option value="90">Четвертий номер ступені, дійсна швидкість головного руху різання, nд=90</option>
    <option value="125">П'ятий номер ступені, дійсна швидкість головного руху різання, nд=125</option>
    <option value="180">Шостий номер ступені, дійсна швидкість головного руху різання, nд=180</option>
    <option value="250">Сьомий номер ступені, дійсна швидкість головного руху різання, nд=250</option>
    <option value="355">Восьмий номер ступені, дійсна швидкість головного руху різання, nд=355</option>
    <option value="500">Дев'ятий номер ступені, дійсна швидкість головного руху різання, nд=500</option>
    <option value="710">Десятий номер ступені, дійсна швидкість головного руху різання, nд=710</option>
    <option value="1000">Одинадцятий номер ступені, дійсна швидкість головного руху різання, nд=1000</option>
    <option value="1400">Дванадцятий номер ступені, дійсна швидкість головного руху різання, nд=1400</option>
    </optgroup>
    <optgroup label="Верстат моделі 2Н150">
    <option value="22.4">Перший номер ступені, дійсна швидкість головного руху різання, nд=22.4</option>
    <option value="31.5">Дугий номер ступені, дійсна швидкість головного руху різання, nд=31.5</option>
    <option value="45">Третій номер ступені, дійсна швидкість головного руху різання, nд=45</option>
    <option value="63">Четвертий номер ступені, дійсна швидкість головного руху різання, nд=63</option>
    <option value="90">П'ятий номер ступені, дійсна швидкість головного руху різання, nд=90</option>
    <option value="125">Шостий номер ступені, дійсна швидкість головного руху різання, nд=125</option>
    <option value="180">Сьомий номер ступені, дійсна швидкість головного руху різання, nд=180</option>
    <option value="250">Восьмий номер ступені, дійсна швидкість головного руху різання, nд=250</option>
    <option value="355">Дев'ятий номер ступені, дійсна швидкість головного руху різання, nд=355</option>
    <option value="500">Десятий номер ступені, дійсна швидкість головного руху різання, nд=500</option>
    <option value="710">Одинадцятий номер ступені, дійсна швидкість головного руху різання, nд=710</option>
    <option value="1000">Дванадцятий номер ступені, дійсна швидкість головного руху різання, nд=1000</option>
    </optgroup>
    <optgroup label="Верстат моделі 2C150">
    <option value="675">Дванадцятий номер ступені, дійсна швидкість головного руху різання, nд=675</option>
    </select></p>

<input type="submit" value="Вирахувати дійсну швидкість головного руху різання nд, м/хв">
<input type="text" name="" value="
<?php
$D = $_GET['D'];
$nd = $_GET['nd'];
$vd=3.14*$D*$nd/1000;      
echo $vd;
?>
">
</fieldset>
</form>







<form method="GET">
<!-- Створюємо блок групування елементів у формі для вираховування крутного моменту від сил опору різання при свердлінні-->
<fieldset>
<legend> КРОК 7. Вираховування крутного моменту від сил опору різання при свердлінні М, Нм</legend> 
<p>Коефіцієнт формули крутного моменту, що залежить від властивостей матеріалу, який обробляється, Cм:</p>
<select  type="text" name="Cm" value="" size="1px">
<optgroup label="Обробка матеріалу сталь конструкційна і стальне лиття з межою міцності 750 Мпа шляхлом свердління, де матеріал ріжучої  частини інструмента - швидкоріжуча сталь">
<option value="0.0345">0.0345</option>
<optgroup label="Обробка матеріалу сталь конструкційна і стальне лиття з межою міцності 750 Мпа шляхлом розсвердлювання, де матеріал ріжучої  частини інструмента - швидкоріжуча сталь">
<option value="0.09">0.09</option>
<optgroup label="Обробка матеріалу сталь жаростійка Х18Н9Т шляхлом свердління, де матеріал ріжучої  частини інструмента - швидкоріжуча сталь">
<option value="0.041">0.041</option>
</optgroup>
</select></p>

<p>Показник степені формули крутного моменту, що залежить від властивостей матеріалу, який обробляється, qм:</p>
<select  type="text" name="qm" value="" size="1px">  
<optgroup label="Обробка матеріалу сталь конструкційна і стальне лиття з межою міцності 750 Мпа шляхлом свердління, де матеріал ріжучої  частини інструмента - швидкоріжуча сталь">
<option value="2.0">2.0</option>
<optgroup label="Обробка матеріалу сталь конструкційна і стальне лиття з межою міцності 750 Мпа шляхлом розсвердлювання, де матеріал ріжучої  частини інструмента - швидкоріжуча сталь">
<option value="1.0">1.0</option>
<optgroup label="Обробка матеріалу сталь жаростійка Х18Н9Т шляхлом свердління, де матеріал ріжучої  частини інструмента - швидкоріжуча сталь">
<option value="2.0">2.0</option>
</optgroup>
</select></p>

<p>Показник степені формули о крутного моменту, що залежить від властивостей матеріалу, який обробляється, yм:</p>
<select  type="text" name="ym" value="" size="1px">  
<optgroup label="Обробка матеріалу сталь конструкційна і стальне лиття з межою міцності 750 Мпа шляхлом свердління, де матеріал ріжучої  частини інструмента - швидкоріжуча сталь">
<option value="0.8">0.8</option>
<optgroup label="Обробка матеріалу сталь конструкційна і стальне лиття з межою міцності 750 Мпа шляхлом розсвердлювання, де матеріал ріжучої  частини інструмента - швидкоріжуча сталь">
<option value="0.8">0.8</option>
<optgroup label="Обробка матеріалу сталь жаростійка Х18Н9Т шляхлом свердління, де матеріал ріжучої  частини інструмента - швидкоріжуча сталь">
<option value="0.7">0.7</option>
</optgroup>
</select></p>

<p>Діаметр ріжучого інструменту D, мм:</p><input  type="text" name="D" value="" size="1px">
<p>Подача S0, мм/об:</p><input  type="text" name="S0" value="" size="1px">     
<p>Поправочний коефіцієнт на осьову складову сили різання, Kp:</p><input  type="text" name="Kp" value="" size="1px">   
</p>
<input type="submit" name="" value="Вирахувати крутний момент від сил опору різання при свердлінні М, Нм">
<input type="text" name="" value="  
<?php
$Cm = $_GET['Cm'];
$D = $_GET['D'];
$qm = $_GET['qm'];
$S0 = $_GET['S0'];
$ym = $_GET['ym'];
$Kp = $_GET['Kp'];
$M=$_GET["M"];
$M1=$_GET["M1"];    
$M=9.81 * $Cm * (pow($D,$qm));
$M1=(pow($S0,$ym));
echo ($M*$M1) * $Kp * 0.101973;
?>
">
</form>
</fieldset>





<form method="GET">
<!-- Створюємо блок групування елементів у формі для вираховування потужності, яка витрачається на різання-->
<fieldset>
<legend> КРОК 8. Вираховування потужності, яка витрачається на різання N, кВт</legend>
<p>Крутний момент від сил опору різання при свердлінні М, Нм:</p><input  type="text" name="M" value"" size="1px">
<p>Дійсна швидкість головного руху різання nд, м/хв:</p><input  type="text" name="nd" value"" size="1px">
</p>
<input type="submit" name"" value="Вирахувати потужність, яка витрачається на різання N, кВт">
<input type="text" name="" value="
<?php
$M = $_GET['M'];
$nd = $_GET['nd'];

$N=$M *$nd /975;

  echo $N;
?>
">
  </form>






<form method="GET">
<legend> КРОК 9. Перевірка достатності дійсної потужності двигуна головного приводу верстата, яка витрачається на різання N, кВт. Якщо N різання (Крок 8) < N шпинделя (Крок 9), то обробка деталі вказаної у завданні можлива. Інакше, обрати менше значення частоти обертання шпинделя у Кроці 6.</legend>
<p>Допустима потужність головного привода верстата N, кВт за технічним паспортом:</p><input  type="text" name="Nd"size="1px">
</p>
<input type="submit" name "" value="Вирахувати достатність потужності електродвигуна головного привода, яка витрачається на різання N, кВт">
<input type="text" name="" value="
<?php
$Nd = $_GET['Nd'];
$Nshp=$Nd *0.8;
echo $Nshp;
?>
">

  <body>
  <p><a href="https://xn--80aqy.com.ua/">Каталог вибору електродвигуна серії АІР для головного приводу верстата </a></p>
 </body>
</fieldset>
  </form>




<p><b>ІІ. ВИРАХОВУВАННЯ ПОТУЖНОСТІ ЕЛЕКТРОДВИГУНА ПРИВОДУ ПОДАЧІ СВЕРДЛИЛЬНОГО ВЕРСТАТА</p></b>
<fieldset>
<legend> КРОК 1. Вираховування потужності електродвигуна приводу подачі свердлильного верстата</legend>
<form method="GET"> <!--вказуємо метод GET, який визначає спосіб передачі інформації з html форми. У даному варіанті зібрана інформація з форми обробляється мовоно РНР-->
  <!-- ВИРАХОВУВАННЯ ПОТУЖНОСТІ ЕЛЕКТРОДВИГУНА ПРИВОДУ ПОДАЧІ СВЕРДЛИЛЬНОГО ВЕРСТАТА-->
Найбільша допустима сила подачі,кН, : <select type="select" name="Ft" value"">
<optgroup label="Найбільша допустима сила подачі верстатів моделі 2Е52, 2Н118">
<option value="5000">5 кН</option>
<optgroup label="Найбільша допустима сила подачі верстата моделі 2К522">
<option value="7000">7 кН</option>
<optgroup label="Найбільша допустима сила подачі верстатів моделі 2Н122, 2Г125, 2Н125">
<option value="9000">9 кН</option>
<optgroup label="Найбільша допустима сила подачі верстата моделі ГС545">
<option value="12000">12 кН</option>
<optgroup label="Найбільша допустима сила подачі верстата моделі 2Н135">
<option value="15000">15 кН</option>
<optgroup label="Найбільша допустима сила подачі верстата моделі 2А53У">
<option value="16000">16 кН</option>
<optgroup label="Найбільша допустима сила подачі верстатів моделей 255,2055, 2Н55, 2М55, 2А554">
<option value="20000">20 кН</option>
<optgroup label="Найбільша допустима сила подачі верстата моделі 2Н150">
<option value="23500">23.5 кН</option>
<optgroup label="Найбільша допустима сила подачі верстата моделі 2М57">
<option value="32000">32 кН</option>
</optgroup>
</select></p>

Швидкість переміщення, мм/хв: <input type="text" name="vper" value"">

</p>
<input type="submit" value="Вирахувати потужність електродвигуна приводу подачі верстата"></form>
<input type="text" name="" value="


<?php
/*За допомогою суперглобального массива $_GET
виводимо прийняті значення для вираховування потужності електродвигуна приводу подачі верстата:*/
$Ft = $_GET['Ft'];
$vper = $_GET['vper'];
echo $P = ($Ft * $vper)/14.4;


?>"
>

  <body>
  <p><a href="https://xn--80aqy.com.ua/">Каталог вибору електродвигуна серії АІР для приводу подачі верстата </a></p>
 </body>
 </fieldset>



<p><b>ІІІ. ВИРАХОВУВАННЯ ПОТУЖНОСТІ ЕЛЕКТРОДВИГУНА НАСОСУ ОХОЛОДЖЕННЯ СВЕРДЛИЛЬНОГО ВЕРСТАТА</p></b>
<fieldset>
<legend> КРОК 1. Вираховування потужності електродвигуна  насосу охолодження свердлильного верстата</legend>
<form method="GET"> <!--вказуємо метод GET, який визначає спосіб передачі інформації з html форми. У даному варіанті зібрана інформація з форми обробляється мовоно РНР-->
 
<p>Густина перекачуваної рідини, Н/м:</p>
<input  type="text" name="gama" value"" size="1px">
<p>Продуктивність насосу Q, Н/м:</p>
<input  type="text" name="Q" value"" size="1px">
<p>Напір насосу H, м:</p>
<input  type="text" name="H" value"" size="1px">
<p>Коефіцієнт корисної дії насосу:</p>
<input  type="text" name="KKD" value"" size="1px">
<p>Коефіцієнт корисної дії передачі:</p>
<input  type="text" name="M" value"" size="1px">
</p>
<input type="submit" value="Вирахувати потужність електродвигуна насосу охолодження верстата">
<input type="text" name="" value="

 <?php
 $KKD = $_GET['KKD'];
 $M = $_GET['M'];
 $Q = $_GET['Q'];
 $H = $_GET['H'];
 $gama = $_GET['gama'];


echo $P=(1.1 * $gama * $Q * $H) /(3600*1000 * $KKD * $M);
 
?>
">


  <body>
  <p><a href="https://xn--80aqy.com.ua/">Каталог вибору електродвигуна серії АІР для насосу охолодження верстата </a></p>
 </body>
</form>
</fieldset>






<p><b>ІV. РОЗРАХУНОК ЕЛЕКТРООБЛАДНАННЯ СВЕРДЛИЛЬНОГО ВЕРСТАТА</p></b>

<fieldset>
<legend> КРОК 1. Розрахунок розрахункового струму навантаження для одного електродвигуна свердлильного верстата</legend>
<form method="GET"> 
<p>Номінальна потужність електродвигуна Рн, кВт:</p>
<input  type="text" name="Pn" value"" size="1px">

<p>Коефіцієнт корисної дії електродвигуна:</p>
<input  type="text" name="KKD" value"" size="1px">

<p>Номінальний коефіцієнт потужності:</p>
<input  type="text" name="cosf" value"" size="1px">

</p>
<input type="submit" value="Вирахувати розрахунковий струм навантаження для одного електродвигуна свердлильного верстата">
<input type="text" name="" value="

 <?php

 $KKD = $_GET['KKD'];
 $Pn = $_GET['Pn'];
 $cosf = $_GET['cosf'];

 echo $Ip= $Pn *1000/(657.4* $KKD* $cosf);

?>
">
</form>
</fieldset>



<fieldset>
<legend> КРОК 2. Вибір проводів і кабелів свердлильного верстата за умовою допустимого нагріву тривалим допустимим струмом</legend>
<form method="GET"> 

<p>Розрахунковий струм навантаження Ір, А:</p>
<input  type="text" name="Ір" value"" size="1px">
<p>Поправочний коєфіцієнт на умову прокладання проводів і кабелів, К1:</p>
<select  type="text" name="K1" value"" size="1px">
<optgroup label="Поправочний коєфіцієнт на умову прокладання проводів і кабелів при розрахунковій температурі середовища +15 градусів цельсія і фактичній температурі середовища +20 градусів цельсія">
<option value="0.96">0.96</option>
<optgroup label="Поправочний коєфіцієнт на умову прокладання проводів і кабелів при розрахунковій температурі середовища +25 градусів цельсія і фактичній температурі середовища +20 градусів цельсія">
<option value="1.04">1.04</option>
</optgroup>
</select></p>
<p>Поправочний коєфіцієнт на кількість працюючих проводів і кабелів, які прокладені разом у землі, у трубах і без труб, К2:</p>
<select  type="text" name="K2" value"" size="1px">
<optgroup label="При кількості кабелів - 1">
<option value="1">1.0</option>
<optgroup label="При кількості кабелів - 2">
<option value="0.9">0.9</option>
<optgroup label="При кількості кабелів - 3">
<option value="0.85">0.85</option>
<optgroup label="При кількості кабелів - 4">
<option value="0.8">0.8</option>
<optgroup label="При кількості кабелів - 5">
<option value="0.78">0.78</option>
</optgroup>
</select></p>

</p>
<input type="submit" value="Вирахувати допустиме струмове навантаження для вибору перерізу провідника">
<input type="text" name="" value="

 <?php
 $K1 = $_GET['K1'];
 $K2 = $_GET['K2'];
 $Ір = $_GET['Ір'];

echo $Idop= $Ір/ $K1* $K2;


?>
">

 <body>
  <p><a href="https://www.avtomats.com.ua/2813-selection_of_cable.html">Каталог вибору проводів і кабелів</a></p>
 </body>
</form>
</fieldset>

<fieldset>
<legend> КРОК 3. Вибір іншого електрообладнання</legend>
<form method="GET"> 

 <body>
  <p><a href="https://www.acko.ua/e-store/xml_catalog/1501/">1. Каталог вибору пристроїв автоматичного захисту, комутаціних пристроїв, пристроїв індикації, вимірювальних пристроїв, запобіжників і тримачів.</a></p>
 </body>
<body>
  <p><a href="">2. Каталог вибору пристроїв автоматичного захисту, комутаціних пристроїв, пристроїв індикації, вимірювальних пристроїв, вимикачві і кінцевих перемикачів, низьковольтних комплектних пристроїв.</a></p>
 </body>
<body>
  <p><a href="https://owen.ua/ru/programmiruemye-logicheskie-kontrollery">3. Каталог вибору програмованих логічних контроллерів.</a></p>
 </body>






</fieldset>
</body>

</html>

